In [21]:
# Dependencies and Setup
import pandas as pd
import csv
#import os

In [22]:
# File to Load (Remember to Change These)
books_data_to_load = "Resources/book900k-1000k.csv"

# Read data file into into Pandas dataframe
books_df = pd.read_csv(books_data_to_load)
#books_df.head()

In [23]:
books_df.shape

(40890, 20)

In [24]:
books_df.describe()

,Id,Rating,PublishYear,PublishMonth,PublishDay,CountsOfReview,pagesNumber,Count of text reviews
count,40890.000000,40890.000000,40890.000000,40890.000000,40890.000000,40890.000000,40890.000000,40890.000000
mean,949177.751431,3.469541,1998.890584,9.709636,6.346075,8.834238,276.196747,8.834238
std,29062.356909,1.242119,8.462135,10.235637,3.565110,71.253610,505.166816,71.253610
min,900000.000000,0.000000,1899.000000,1.000000,1.000000,0.000000,0.000000,0.000000
25%,923881.250000,3.470000,1995.000000,1.000000,3.000000,0.000000,153.000000,0.000000
50%,948838.500000,3.840000,2001.000000,4.000000,6.000000,1.000000,241.000000,1.000000
75%,974600.250000,4.090000,2005.000000,17.000000,9.000000,4.000000,340.000000,4.000000
max,999998.000000,5.000000,2020.000000,31.000000,12.000000,6495.000000,80500.000000,6495.000000

In [25]:
columns = books_df.columns
columns

Index(['Id', 'Name', 'Authors', 'ISBN', 'Rating', 'PublishYear',
       'PublishMonth', 'PublishDay', 'Publisher', 'RatingDist5', 'RatingDist4',
       'RatingDist3', 'RatingDist2', 'RatingDist1', 'RatingDistTotal',
       'CountsOfReview', 'Language', 'pagesNumber', 'Description',
       'Count of text reviews'],
      dtype='object')

In [26]:
# drop unused columns
books_df.drop(columns = ['RatingDist5', 'RatingDist4',
               'RatingDist3', 'RatingDist2', 'RatingDist1', 'pagesNumber',
                'RatingDistTotal', 'Count of text reviews', 'CountsOfReview','Description'], inplace=True)

In [27]:
books_df = books_df.rename(columns={'Id':'BookId', 'Name':'Title'})

In [28]:
books_df.head()

,BookId,Title,Authors,ISBN,Rating,PublishYear,PublishMonth,PublishDay,Publisher,Language
0,900000,Cabinet 03: Weather,Jeffrey Kastner,1932698019,4.00,2004,2,1,Cabinet,NaN
1,900001,"Workouts in a Binder for Swimmers, Triathletes...",Nick Hansen,1931382743,4.48,2005,18,11,Velo Press,NaN
2,900002,Las 120 jornadas de Sodoma,Marquis de Sade,8472233847,3.12,1992,1,3,TusQuets,NaN
3,900004,The Traveler: An American Odyssey in the Himal...,Eric Hansen,0871563509,4.18,1995,6,6,"Random House, Inc.",NaN
4,900006,Vertical Smile,Richard Condon,0297994026,3.74,1972,20,4,Littlehampton Book Services Ltd,NaN

In [29]:
# checking number of language in the books dataset
language_counts = books_df.groupby('Language').count()
language_counts.shape

(30, 9)

In [30]:
# replace all NaN value in Language column by eng

values ={'Language':'eng'}
books_df.fillna(value = values, inplace=True)

In [31]:
books_df.head()

# save to csv file
books_df.to_csv("Resources/cleaned_books.csv", index=False)

In [32]:
rating_counts = books_df.groupby("Rating").count()
rating_counts.head()
#rating_counts.shape

,BookId,Title,Authors,ISBN,PublishYear,PublishMonth,PublishDay,Publisher,Language
Rating,,,,,,,,,
0.00,4013,4013,4013,4008,4013,4013,4013,3961,4013
1.00,93,93,93,92,93,93,93,93,93
1.33,1,1,1,1,1,1,1,1,1
1.50,11,11,11,11,11,11,11,9,11
1.55,1,1,1,1,1,1,1,1,1

In [33]:
author_counts = author_list = books_df.Authors.nunique()
author_counts

28666

In [34]:
author_list = books_df.groupby("Authors").nunique()['Authors']

In [35]:
author_list_df = pd.DataFrame(author_list)

In [36]:
# rename column and reset index
author_list_df = author_list_df.rename(columns={'Authors':'Count'})
author_list_df.reset_index(inplace=True)
author_list_df

                        Authors  Count
0      'Izz al-Din Ibn al-Athir      1
1                       50 Cent      1
2      6' Ferret Writers' Group      1
3           A H Keesman-Marwitz      1
4                     A. Ashley      1
...                         ...    ...
28661       Øivind Storm Bjerke      1
28662               Ānandamūrti      1
28663             Дарья Донцова      1
28664         جبرا إبراهيم جبرا      1
28665            مسلم بن الحجاج      1

[28666 rows x 2 columns]

In [37]:
# sort authors list  by name
author_list_df = author_list_df.sort_values(["Authors"], ascending = True)
#author_list_df.tail()

In [38]:
# save to csv file
author_list_df.to_csv("Resources/authors_list.csv", index=False)

### cleaned books

In [39]:
# before: there was 40,890 records and 20 columns with NaN value in Language

# after: removed eleven columns ('RatingDist5', 'RatingDist4',
#     'RatingDist3', 'RatingDist2', 'RatingDist1', 
#     'RatingDistTotal','pagesNumber','Count of text reviews', 'Description') from the dataset
# rename 'Id' to 'Book_id' and 'Name' to 'Title'
# replace all NaN value in Language by 'eng'

# observastion: in the cleaned_books dataset there is "blank" and date ("10/18/2020") 
# value in publisher column. please take this into consideration when using the cleaned_books dataset.